Repository: sggua/fs-backup
Catalog: locale/*.po
Languages: uk

source: Usage: $0 [mode] [options]
uk: Використання: $0 [режим] [опції]

source: MODES (choose one):
uk: РЕЖИМИ РОБОТИ (оберіть один):

source: Create a new full backup.
uk: Створити нову повну резервну копію.

source: Synchronize with the latest full backup (update it).
uk: Синхронізувати з останньою повною копією (оновити її).

source: Create an incremental backup relative to the latest full one.
uk: Створити інкрементну копію відносно останньої повної.

source: Restore the system from a backup for the specified date (YYYY-MM-DD).
uk: Відновити систему з копії за вказану дату (YYYY-MM-DD).

source: REQUIRED PARAMETERS:
uk: ОБОВ'ЯЗКОВІ ПАРАМЕТРИ:

source: For --recover: <date in YYYY-MM-DD format>
uk: Для --recover: <дата у форматі YYYY-MM-DD>

source: ADDITIONAL OPTIONS:
uk: ДОДАТКОВІ ОПЦІЇ:

source: Specify the backup source (default: /).
uk: Вказати джерело копіювання (типово: /).

source: Specify the destination directory for backups (default: current directory).
uk: Вказати теку призначення для бекапів (типово: поточна тека).

source: Run without asking for confirmation.
uk: Запустити без додаткового підтвердження.

source: Show this help message.
uk: Показати цю довідку.

source: OPERATION PLAN
uk: ПЛАН ВИКОНАННЯ

source: Used --force or -y flag, proceeding without confirmation.
uk: Використано ключ --force або -y, запускаю виконання.

source: Do you agree to execute this plan? [y/N]:
uk: Ви погоджуєтеся на виконання цього плану? [y/N]:

source: Plan confirmed. Starting execution...
uk: План підтверджено. Розпочинаю виконання...

source: Operation canceled by the user.
uk: Операцію скасовано користувачем.

source: IMPORTANT! This script is intended for system recovery.
uk: ВАЖЛИВО! Цей скрипт призначений для відновлення системи.

source: Run it from a Live-CD/USB environment with sudo privileges.
uk: Запускайте його з Live-CD/USB середовища з правами sudo.

source: DO NOT RUN ON A LIVE (RUNNING) SYSTEM!
uk: НЕ ЗАПУСКАЙТЕ НА ПРАЦЮЮЧІЙ СИСТЕМІ!

source: !!! WARNING: SYSTEM RECOVERY PROCESS IS STARTING !!!
uk: !!! УВАГА: ПОЧИНАЄТЬСЯ ПРОЦЕС ВІДНОВЛЕННЯ СИСТЕМИ !!!

source: Please ensure you are running this script from a Live-CD/USB.
uk: Переконайтесь, що Ви запустили цей скрипт з Live-CD/USB.

source: Press Enter to continue or Ctrl+C to cancel...
uk: Натисніть Enter для продовження або Ctrl+C для скасування...

source: Source:
uk: Джерело:

source: Destination:
uk: Призначення:

source: ✅ Recovery complete. Manually create system directories:
uk: ✅ Відновлення завершено. Створіть вручну системні каталоги:

source: After this, you need to reinstall the bootloader (GRUB).
uk: Після цього потрібно перевстановити завантажувач (GRUB).

source: Error: --recover requires a date in YYYY-MM-DD format.
uk: Помилка: для --recover потрібно вказати дату YYYY-MM-DD.

source: Error: --source requires a path.
uk: Помилка: для --source потрібно вказати шлях.

source: Error: --dest requires a path.
uk: Помилка: для --dest потрібно вказати шлях.

source: Unknown parameter: %s
uk: Невідомий параметр: %s

source: Error: required command '%s' is not found. Please install it.
uk: Помилка: необхідна програма '%s' відсутня. Будь ласка, встановіть її.

source: Error: source directory '%s' not found.
uk: Помилка: каталог-джерело '%s' не знайдений.

source: Error: destination directory '%s' does not exist or is not writable.
uk: Помилка: каталог призначення '%s' не існує або недоступний для запису.

source: Analyzing disk space for full backup...
uk: Аналіз дискового простору для повної копії...

source: Mode:
uk: Режим:

source: Full Backup
uk: Повна резервна копія

source: Source:
uk: Джерело:

source: Destination:
uk: Призначення:

source: Required space (estimate):
uk: Необхідно місця (оцінка):

source: Available on destination disk:
uk: Доступно на диску призначення:

source: WARNING
uk: УВАГА

source: Not enough free space on the destination disk!
uk: На диску призначення недостатньо вільного місця!

source: Creating full backup in %s...
uk: Створення повної копії до теки %s...

source: ✅ Full backup successfully created in %s
uk: ✅ Повна копія успішно створена в %s

source: Error: no full backup found to sync with.
uk: Помилка: не знайдено повної копії для синхронізації.

source: Synchronization
uk: Синхронізація

source: Syncing with:
uk: Синхронізація з:

source: Files deleted from the source will also be deleted from the backup.
uk: Файли, видалені з джерела, будуть видалені також з резервної копії.

source: The backup will be renamed to:
uk: Резервну копію буде перейменовано на:

source: Syncing with %s...
uk: Синхронізація з %s...

source: ✅ Synchronization with %s is complete.
uk: ✅ Синхронізацію з %s завершено.

source: Backup has been renamed to:
uk: Резервну копію перейменовано на:

source: Error: no base backup found to create an increment from.
uk: Помилка: не знайдено базової копії для створення інкременту.

source: Incremental Backup
uk: Інкрементна резервна копія

source: Method:
uk: Спосіб:

source: Hard-links (saves space, fast execution)
uk: Hard-links (економія місця, швидке виконання)

source: Base backup:
uk: Базова копія:

source: Changes will be saved to:
uk: Зміни будуть збережені до теки:

source: Creating incremental backup in %s...
uk: Створення інкрементної копії до теки %s...

source: Generating list of deleted files
uk: Складання списку видалених файлів

source: !!! WARNING: RESTORING FROM AN INCREMENTAL BACKUP !!!
uk: !!! УВАГА: ВІДНОВЛЕННЯ З ІНКРЕМЕНТНОЇ КОПІЇ !!!

source: This process will first restore the full backup, then apply the changes.
uk: Цей процес відновить спочатку повну копію, а потім застосує зміни.

source: -> Step 1/3: Restoring from the base full backup...
uk: -> Крок 1/3: Відновлення з базової повної копії...

source: -> Step 2/3: Applying changes from the incremental backup...
uk: -> Крок 2/3: Застосування змін з інкрементної копії...

source: -> Step 3/3: Deleting files that are no longer in the source...
uk: -> Крок 3/3: Видалення файлів, що відсутні в джерелі...

source: Deleting:
uk: Видалення:

source: ✅ Recovery complete.
uk: ✅ Відновлення завершено.

source: ✅ Incremental backup created in %s
uk: ✅ Інкрементна копія створена в %s

source: Error: no suitable full backup found for recovery on date %s.
uk: Помилка: не знайдено відповідної повної копії для відновлення на дату %s.

source: System Recovery
uk: Відновлення системи

source: Target date:
uk: Цільова дата:

source: Increments to apply:
uk: Інкременти для застосування:

source: No incremental backups found; only the full backup will be restored.
uk: Інкрементні копії не знайдені, буде відновлено лише повну копію.

source: WARNING: THIS OPERATION WILL OVERWRITE DATA IN:
uk: УВАГА: ЦЯ ОПЕРАЦІЯ ПЕРЕЗАПИШЕ ДАНІ В:

source: Restoring to %s...
uk: Відновлення до %s...

source: -> Step 1: Restoring from base full backup %s...
uk: -> Крок 1: Відновлення з базової повної копії %s...

source: -> Step %s: Applying increment %s...
uk: -> Крок %s: Застосування інкременту %s...

source: ✅ Recovery to %s for date %s is complete.
uk: ✅ Відновлення до %s на дату %s завершено.

source: Error: no mode specified.
uk: Помилка: не вказано режим роботи.

source: Operation completed successfully.
uk: Операцію успішно завершено.
